Repository: Bingdom/Nuitka-website
Catalog: locales/*/LC_MESSAGES/commercial.po
Languages: de_de

source: Protect your IP against reverse engineering with the Python compiler Nuitka and turn your Python code into binary. Protect code, data, outputs and tracebacks!
de_de: Schütze mit dem Python Compiler Nuitka deine IP gegen Reverse Engineering und verwandle deinen Python Code in eine Binärdatei. Schütze Code, Daten, Ausgaben und Tracebacks.

source: As a commercial user of Python, you definitely need these 4 critical features that only Nuitka commercial offers. Protect your code, your data, your outputs, and tracebacks while still enjoying major convenience features for your application.
de_de: Als kommerzieller Benutzer von Python benötigen Sie auf jeden Fall diese 4 sehr wichtigen Funktionen, die nur ``Nuitka Commercial`` bietet. Schützen Sie Ihren Code, Ihre Daten, Ihre Ausgaben und Rückverfolgungen und genießen Sie gleichzeitig wichtige Komfortfunktionen für Ihre Anwendung.

source: Protection vs. Reverse Engineering
de_de: Schutz vs. Reverse Engineering

source: Hiding your source code and contained keys is crucial to your IP protection. For this, you need the Nuitka commercial package. It contains plugins to Nuitka that will achieve the following:
de_de: Das Verbergen Ihres Quellcodes und enthaltener Schlüssel ist entscheidend für Ihren IP-Schutz. Dazu benötigen Sie das ``Nuitka Commercial``-Paket. Es enthält Plugins für Nuitka, die Folgendes erreichen:

source: Obfuscate contained program constants data
de_de: Im Programm enthaltene Konstanten verschleiern

source: Your encryption keys, your program texts, your library usages, all expose textual information, that can be valuable input in Reverse Engineering.
de_de: Ihre Verschlüsselungsschlüssel, Ihre Programmtexte, Ihre Bibliotheksnutzungen, alles sind wertvolle Informationen, die das Reverse Engineering erleichtert.

source: Normally these constants are plain and readable in the created programs (and of course your Python source code or bytecode). Compiling with Nuitka gives you protection of the code, but with the data being easily readable, it will be less effective.
de_de: Normalerweise sind diese Konstanten in den erstellten Programmen (und natürlich Ihrem Python-Quellcode oder Bytecode) leicht lesbar. Das Kompilieren mit Nuitka bietet Ihnen Schutz für den Code, aber da die Daten leicht lesbar sind, wird es weniger effektiv sein.

source: `Read more.... <commercial/protect-constants-data.html>`__
de_de: `Weiterlesen.... <commercial/protect-constants-data.html>`__

source: Another facet of the data protection is data files. When your program includes data files to work on, these are visible in the file system. Sometimes, e.g. via QML files of Qt, your program behavior can be changed by an attacker modifying these files.
de_de: Eine weitere Gefahr sind Dateien. Wenn Ihr Programm Datendateien zum Bearbeiten enthält, sind diese im Dateisystem sichtbar. Manchmal, zB über QML-Dateien von Qt, kann Ihr Programmverhalten von einem Angreifer, der diese Dateien modifiziert verändert werden.

source: Therefore Nuitka commercial allows you to include data files as part of the program constants and protect it in the same way as other constants. Without these files accessible, the attacker will not has these an an attack vector.
de_de: Daher erlaubt ``Nuitka Commercial``, Datendateien als Teil der Programmkonstanten einzubinden und sie auf die gleiche Weise wie andere Konstanten zu schützen. Wenn diese Dateien nicht zugänglich sind, kann der Angreifer sie nicht als Angriffsvektor nutzen.

source: `Read more.... <commercial/protect-data-files.html>`__
de_de: `Weiterlesen.... <commercial/protect-data-files.html>`__

source: When your program is deployed and crashing, you could take potentially successful steps against these tracebacks appearing. But when you need to support your client, you need to be able to to actually tell, why your software is crashing.
de_de: Wenn Ihr Programm eingesetzt wird und abstürzt, können Sie möglicherweise erfolgreich gegen das Auftreten dieser Tracebacks vorgehen. Aber wenn Sie Ihren Kunden unterstützen müssen, müssen Sie in der Lage sein, tatsächlich zu erkennen, warum Ihre Software abstürzt.

source: Python tracebacks are good for this, but you cannot want them to be readable to the user. This is very traceback encryption comes in. Nuitka with the commercial plugin will make sure to encrypt all traceback outputs. They still carry the information as you want, but *only you* will be able to decode them.
de_de: Python-Tracebacks sind gut dafür geeignet, aber Sie wollen nicht, dass sie für den Benutzer lesbar sind. Hier kommt die Traceback-Verschlüsselung ins Spiel. Nuitka mit dem kommerziellen Plugin sorgt dafür, dass alle Traceback-Ausgaben verschlüsselt werden. Sie enthalten immer noch die von Ihnen gewünschten Informationen, aber nur Sie können sie entschlüsseln.

source: Symmetric encryption (and asymmetric encryption in a future update) are available for you to use there.
de_de: Symmetrische Verschlüsselung (und asymmetrische Verschlüsselung in einem zukünftigen Update) sind dort für Sie verfügbar.

source: `Read more.... <commercial/encrypted-tracebacks.html>`__
de_de: `Weiterlesen.... <commercial/encrypted-tracebacks.html>`__

source: If you need to query information from a machine, or just in general want to have perfect protection, you can use the Nuitka plugin to make sure it can only output encrypted information on standard output and standard error.
de_de: Wenn Sie Informationen von einer Maschine abfragen müssen oder generell einen perfekten Schutz haben wollen, können Sie das Nuitka-Plugin verwenden, um sicherzustellen, dass nur verschlüsselte Informationen auf der Standardausgabe und dem Standardfehler ausgeben werden.

source: This will allow you to decode outputs as necessary, and will make sure it's not readable to anybody but you.
de_de: So können Sie die Ausgaben bei Bedarf entschlüsseln und sicherstellen, dass es für niemanden außer Ihnen lesbar ist.

source: For select few packages, these are only supported with Nuitka commercial.
de_de: Einige wenige Pakete werden nur mit ``Nuitka Commercial`` unterstützt.

source: `Read more.... <commercial/commercial-only-packages.html>`__
de_de: `Weiterlesen.... <commercial/commercial-only-packages.html>`__

source: Special needs (Commercial only use cases)
de_de: Besondere Anforderungen (nur kommerzielle Anwendungsfälle)

source: In this instance, you have special wishes that only commercial customers will have and that are effort to maintain.
de_de: In diesem Fall haben Sie spezielle Wünsche, die nur für gewerbliche Kunden relevant und mit viel Aufwand zu erfüllen sind.

source: You might e.g. you want to deploy a Windows service
de_de: Sie könnten z.B. einen Windows-Dienst einrichten wollen.

source: For this, there is a dedicated plugin in Nuitka that makes deployment of a practically unchanged program as a service very easy.
de_de: Hierfür gibt es in Nuitka ein spezielles Plugin, das die Bereitstellung von einem praktisch unverändertem Programm als Dienst sehr einfach macht.

source: `Read more.... <commercial/windows-service.html>`__
de_de: `Weiterlesen.... <commercial/windows-service.html>`__

source: You might need to support special commercial grade software.
de_de: Möglicherweise müssen Sie spezielle kommerzielle Software unterstützen.

source: This can be done, but you might have to pay for the development time this takes.
de_de: Das ist machbar, aber Sie müssen möglicherweise für die Entwicklungszeit bezahlen, die es braucht.

source: You might need to support very old OSes, e.g. RHEL 5.
de_de: Sie müssen möglicherweise sehr alte Betriebssysteme unterstützen wie zum Beispiel RHEL 5.

source: Again, this can be done, but you might have to pay for the development time this takes.
de_de: Auch das ist möglich, aber Sie müssen möglicherweise für die Entwicklungszeit bezahlen, die dafür benötigt wird.

source: Automatic download, alerts to, applying updates of deployed software.
de_de: Automatisches Herunterladen, Benachrichtigung und Anwendung von Updates für die bereitgestellte Software.

source: This is not yet implemented, but will be added in a future update.
de_de: Diese Funktion ist noch nicht implementiert, wird aber in einem zukünftigen Update hinzugefügt werden.

source: Support for these things will also be covered in the Nuitka commercial package, and while you might not care necessarily about hiding your source or data, but much rather you care about the quality of deployment of your software.
de_de: Die Unterstützung für solche Dinge wird auch in dem ``Nuitka Commercial`` Paket abgedeckt Hierbei geht es nicht unbedingt um das Verstecken des Codes oder ihren Daten, sondern um die Qualität ihrer Software.

source: Priority Issue Solutions
de_de: Vorrangige Problemlösungen

source: You might have an issue that blocks you from using Nuitka, which you want to use though, because of performance gains, the IP protection, with or without the commercial plugins.
de_de: Vielleicht haben Sie ein Problem, das Sie daran hindert, Nuitka zu verwenden, das Sie aber wegen der Leistungssteigerung und des IP-Schutzes mit oder ohne kommerzielle Plugins nutzen möchten.

source: The Nuitka Priority package gives you access to elevated priority of your issues. If you subscribe to this, reported issues will be solved with highest priority, to enable you using Nuitka.
de_de: Das Nuitka Priority-Paket bietet Ihnen Zugang zu einer erhöhten Priorität für Ihre Probleme. Wenn Sie dieses Paket abonnieren, werden die gemeldeten Probleme mit höchster Priorität gelöst, damit Sie Nuitka nutzen können.

source: Sponsorship
de_de: Sponsoring

source: You are happy in using Nuitka and you want to benefit it, because it solves a crucial part of your workflow in deployment. You may or may not need the priority package or the commercial package. You can pay the relatively large amount and help Nuitka development in general. And you can know that it remains active and supported and pay back to the relatively free service you get on a daily basis.
de_de: Sie sind mit Nuitka zufrieden und wollen es nutzen, weil es einen wichtigen Teil Ihrer Arbeitsabläufe bei der Bereitstellung löst. Sie können das Prioritätspaket oder das kommerzielle Paket benötigen oder auch nicht. Sie können den relativ hohen Betrag bezahlen und die Entwicklung von Nuitka im Allgemeinen unterstützen. Und Sie können wissen, dass es aktiv bleibt und unterstützt wird und den relativ kostenlosen Service, den Sie täglich erhalten.

source: Naturally sponsors will be entitled to all access and treated with highest priority.
de_de: Natürlich haben Sponsoren das Recht auf jeden Zugang und werden mit höchster Priorität behandelt.

source: Pricing
de_de: Preisgestaltung

source: `Subscribe now </stripe/checkout-commercial-subscription>`__
de_de: `Abonniere jetzt </stripe/checkout-commercial-subscription>`__

source: Commercial only Features
de_de: Nur kommerzielle Features

source: All your applications
de_de: All ihre Anwendungen

source: Standard Support
de_de: Standart Support

source: `Subscribe now </stripe/checkout-priority-subscription>`__
de_de: `Abonniere jetzt </stripe/checkout-priority-subscription>`__

source: Best Support
de_de: Bester Support

source: Issues have **Priority**
de_de: Probleme haben **Priorität**

source: **No** Commercial features
de_de: **Keine** kommerziellen Features

source: `Subscribe now </stripe/checkout-full-subscription>`__
de_de: `Abonniere jetzt </stripe/checkout-full-subscription>`__

source: `Subscribe now </stripe/checkout-sponsor-subscription>`__
de_de: `Abonniere jetzt </stripe/checkout-sponsor-subscription>`__

source: Roadmap Influence
de_de: Roadmap Einfluss

source: Use Cases Priority
de_de: Priorität der Anwendungsfälle

source: Contact Us
de_de: Kontaktiere uns

source: Please use `this form to contact us <https://docs.google.com/forms/d/e/1FAIpQLSeGVpDqhuD0-hkcbsxzQD85PmDdZ_Z31HBIk3ttojcpbSlagg/viewform?usp=sf_link>`_ with intent of buying Nuitka services
de_de: Bitte benutze `diese Formular um uns zu kontaktieren <https://docs.google.com/forms/d/e/1FAIpQLSeGVpDqhuD0-hkcbsxzQD85PmDdZ_Z31HBIk3ttojcpbSlagg/viewform?usp=sf_link>`_ mit der Absicht, die Dienstleistungen von Nuitka zu kaufen
